Autodesk.Revit.DB.FormatUtils.Format(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.UnitType,System.Double)
Formats a number with units into a string based on the units formatting settings for a document.
Remarks:
For additional formatting options, see UnitFormatUtils.Format()
This method is equivalent to calling UnitFormatUtils.Format() with
the Units object obtained from Document.GetUnits() and with
maxAccuracy and forEditing set to false.
document:
The document whose Units object will be used for the units formatting settings.
unitType:
The unit type of the value to format.
value:
The value to format, in Revit's internal units.
Returns:
The formatted string.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
-or-
The given value for value is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2013

Autodesk.Revit.DB.FormatUtils
A utility class for formatting numbers with units.
Since:
2013